app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 7]]
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy #add something here to delete associated reviews?