app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@review = @movie.reviews.new(review_attributes)
		if @review.save

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 2]]
---
	def edit
		@review = @movie.reviews.find(params[:id])